Documents/НачисленияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>НачисленияСотрудникам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыГрафиковРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Documents/НачисленияСотрудникам/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Начисления Из ТЧ_Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаТЧ_Начисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаТЧ_Начисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаТЧ_Начисления.ДатаОкончания);
		Движение.ПериодРегистрации = ТекСтрокаТЧ_Начисления.ДатаНачала;
		Движение.БазовыйПериодНачало = ТекСтрокаТЧ_Начисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаТЧ_Начисления.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаТЧ_Начисления.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаТЧ_Начисления.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаТЧ_Начисления.Результат;
	КонецЦикла;
	
	
	//Записываем движения регистров
	Движения.Начисления.Записать();
	
	//Получим список всех сотрудников, содержащихся в документе
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	НачисленияСотрудникамНачисления.Сотрудник
	|ИЗ
	|	Документ.НачисленияСотрудникам.ТЧ_Начисления КАК НачисленияСотрудникамНачисления
	|ГДЕ
	|	НачисленияСотрудникамНачисления.Ссылка = &ТекущийДокумент");
	
	Запрос.УстановитьПараметр("ТекущийДокумент",Ссылка);
	
	//Сформируем список сотрудников
	
	ТаблЗнач = Запрос.Выполнить().Выгрузить();
	МассивСотрудников=ТаблЗнач.ВыгрузитьКолонку("Сотрудник");
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Оклад, МассивСотрудников);
	Движения.Начисления.Записать( ,Истина);
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Премия, МассивСотрудников);
	Движения.Начисления.Записать( ,Истина);
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Больничный, МассивСотрудников);
	Движения.Начисления.Записать( ,Истина)
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
